benchmarks/cases/real_cases/from_bulut/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    note        "mesh decomposition control dictionary";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  16;

method          scotch;

scotchCoeffs
{
//    processorWeights (1 4 1 4 1 4 1 4 1 4 1 4 1 4 1 4);
}

hierarchicalCoeffs
{
    n           (2 4 1);
    delta       0.001;
    order       xyz;
}

// ************************************************************************* //
